#!/usr/local/www/cgi-bin/tablecg
#
# $DragonFly: site/data/goals/index.cgi,v 1.5 2004/04/16 13:23:37 justin Exp $
# $Id: index.cgi,v 1.2 2004/08/24 13:59:41 wids Exp $

$TITLE(DragonFly - Extreme BSD Evolution, The Road to the Future)

<h1>DragonFly って何ですか?</h1>
<p>
DragonFly は 2 年目のプロジェクトになりました。
私達がここに概略を書く目標へ更に近付くためには、多くの基礎を築くでしょう。
私達の様々な目標のリンクをチェックすることによって、プロジェクトが達成することを望んでいるカーネルの様々な本質的なイメージとシステムデザインについてのポジションペーパーを持ち出すことができるようになります。
</p>
<p>
私達の目標の中で、第一に、最も重要なことは、それらを小さなサイズの塊として実装可能にすることを望みつつ、同時に統一されたシステムのための優れた安定性を保持することです。
目標が任意の特定の順番でリストされていないとはいえ、妥協しない統一されたシステムの安定性へ少しずつ進歩することを可能にする事柄への自然な順番があります。
私達がそれを 100% 達成することは多分できないにせよ、第一に私達の考えにある称賛に値する目標です。
メッセージングシステムが努力の鍵となるでしょう。
もし私達がそれを得ることができたなら、構築可能な残りの仕事の最上位に、卓越した(そしてデバッガブルな) API をすえることができるでしょう。
</p>
