#!/usr/local/www/cgi-bin/tablecg
#
# $DragonFly: site/data/main/bugs.cgi,v 1.6 2004/05/08 21:23:30 justin Exp $
# $Id: bugs.cgi,v 1.3 2004/10/11 15:30:31 wids Exp $

$TITLE(DragonFly - Reporting Bugs)
<p>
本プロジェクトはあらゆるバグ報告を歓迎し、そしてまたそれらを報告するための幾つかの方法を準備することで、可能な限り簡単にバグ報告ができるよう、努力しています。
</p>
<ul>
    <li>(右のアドレス宛に)メールでバグを報告できます:  bugs at dragonflybsd.org</li>
    <li>私達のプライベートニュースグループ宛に(バグ報告を)投稿できます:&nbsp;
	<a href="nntp://nntp.dragonflybsd.org/dragonfly.bugs">
		nntp://nntp.dragonflybsd.org/dragonfly.bugs</a></li>
    <li>しかるべき公式のバグトラッキングシステムができた際には、そこへバグ報告できるようになるでしょう。</li>
</ul>
<p>
メールやニュースグループでのバグ報告が一般的な方法です。
私達がそれに返事をしたり行動できたりすることに関係なく、バグ報告を投稿できることはあなたに良い感触を与えてくれると思います。
報告は永久に保存され、たとえ私達がすぐにそれに対応・応答することができなかったとしても、将来に起こりうる何らかの対応のためにずっと記録されることになります。
</p>
<p>
ソースが公開されたプロジェクトですから、バグ報告を提出することによる効果は多くの要因に左右されます。
最もやる気を起こさせるのは、簡潔さと高水準の詳細です。
パッチを含んだバグ報告は最高水準の精査を与えてくれます。
それは我々にとって金塊のようなものです。
我々の側では、バグを見付け再現できることが、問題を解決する可能性を高めることに繋がります。
もし我々が強い興味を抱かなければ、バグに対し何もしようとしないでしょう。
例えば、バグがプロジェクトの目標に掲げたものやゴールのリストから外れていた場合には、私達はあなたにそう伝えることになるでしょう。
重ねて言いますが、これはあなたを冷遇しているわけではなく、単純に作業の優先順位からそうなっているだけです。
</p>
